RebelTechnology/OpenWare/Genius/Genius.ioc
SPI5.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_128
PA6.Signal=S_TIM3_CH1
PG14.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
Dma.ADC3.1.Direction=DMA_PERIPH_TO_MEMORY
SH.FMC_D0_DA0.0=FMC_D0,sd-16b-d1
RCC.D1PPRE=RCC_APB3_DIV2
SH.FMC_D4_DA4.ConfNb=1
NVIC.OTG_FS_IRQn=true\:10\:0\:true\:false\:true\:true\:true\:true
ProjectManager.ToolChainLocation=
VP_USB_HOST_VS_USB_HOST_AUDIO_FS.Mode=AUDIO_FS
RCC.LSI_VALUE=32000
USB_OTG_FS.VirtualMode=Host_Only
SH.FMC_A9.0=FMC_A9,12b-sda1
USB_DEVICE.CLASS_NAME_HS=AUDIO
PF8.Signal=SPI5_MISO
SH.FMC_D4_DA4.0=FMC_D4,sd-16b-d1
RCC.DIVR1Freq_Value=480000000
USB_DEVICE.VirtualMode-AUDIO_HS=Audio
USART2.WordLength=WORDLENGTH_8B
RCC.PLLSAIN=100
PF5.Signal=FMC_A5
USB_DEVICE.VirtualModeHS=Audio_HS
Dma.Request2=SAI1_A
SAI1.Synchro-SAI_B_SyncSlave=SAI_SYNCHRONOUS
Dma.Request1=ADC3
Dma.SAI1_B.3.MemDataAlignment=DMA_MDATAALIGN_WORD
Dma.Request3=SAI1_B
SPI2.Direction=SPI_DIRECTION_2LINES_TXONLY
PF0.Signal=FMC_A0
PE7.Signal=FMC_D4_DA4
SH.FMC_NBL0.ConfNb=1
SAI1.Synchro-SAI_A_AsyncSlave=SAI_ASYNCHRONOUS
Dma.Request0=SPI2_TX
PE3.Mode=SAI_B_SyncSlave
PE2.GPIO_Label=CS_SCK
RCC.Tim2OutputFreq_Value=240000000
USB_DEVICE.PRODUCT_STRING_AUDIO_HS=OWL-MIDI
RCC.DFSDMACLkFreq_Value=48000000
Mcu.Pin82=VP_USB_DEVICE_VS_USB_DEVICE_AUDIO_HS
Mcu.Pin83=VP_USB_HOST_VS_USB_HOST_AUDIO_FS
PA3.Signal=USART2_RX
Dma.SAI1_A.2.Mode=DMA_CIRCULAR
SH.FMC_A3.ConfNb=1
PB3\ (JTDO/TRACESWO).GPIO_Label=ENC1_CH2
Dma.SAI1_B.3.EventEnable=DISABLE
Dma.ADC3.1.SyncRequestNumber=1
RCC.I2SFreq_Value=96000000
USB_HOST.IPParameters=VirtualModeFS,USBH_HandleTypeDef-AUDIO_FS
SH.FMC_A9.ConfNb=1
SH.S_TIM2_CH1.0=TIM2_CH1,Encoder_Interface
Dma.SPI2_TX.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
RCC.UART7Freq_Value=42000000
PC10.GPIO_Label=TR_IN_B
PC9.GPIO_Label=USB_HOST_PWR_EN
ProjectManager.NoMain=false
SPI4.DataSize=SPI_DATASIZE_8BIT
PG1.Signal=FMC_A11
Dma.SAI1_B.3.MemInc=DMA_MINC_ENABLE
NVIC.SavedSvcallIrqHandlerGenerated=true
PC11.Signal=GPXTI11
RCC.SAI4BFreq_Value=48000000
SH.FMC_SDCLK.ConfNb=1
Dma.SAI1_A.2.Instance=DMA2_Stream1
TIM6.Prescaler=3500
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
ProjectManager.DefaultFWLocation=true
PD9.Signal=FMC_D14_DA14
USB_DEVICE.SERIALNUMBER_STRING_AUDIO_HS=00000000010E
PB12.Locked=true
ProjectManager.DeletePrevious=true
RCC.LCDTFToutputFreq_Value=25000000
USB_DEVICE.IPParameters=CLASS_NAME_HS,VirtualModeHS,MANUFACTURER_STRING-AUDIO_HS,VID-AUDIO_HS,PID_AUDIO_HS,SERIALNUMBER_STRING_AUDIO_HS,PRODUCT_STRING_AUDIO_HS,VirtualMode-AUDIO_HS,USBD_LPM_ENABLED-AUDIO_HS,USBD_AUDIO_FREQ-AUDIO_HS
SPI5.Mode=SPI_MODE_MASTER
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
Dma.SAI1_B.3.FIFOMode=DMA_FIFOMODE_DISABLE
RCC.SPI6Freq_Value=120000000
PC12.GPIOParameters=GPIO_Label
PF7.Mode=Full_Duplex_Master
Dma.SAI1_A.2.Priority=DMA_PRIORITY_HIGH
VP_FREERTOS_VS_CMSIS_V1.Signal=FREERTOS_VS_CMSIS_V1
Dma.SAI1_A.2.SignalID=NONE
Dma.SAI1_B.3.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
SH.S_TIM2_CH2.0=TIM2_CH2,Encoder_Interface
PA9.Mode=Activate_VBUS
PB4\ (NJTRST).GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
SH.FMC_A15_BA1.ConfNb=1
RCC.SPI45Freq_Value=120000000
TIM6.IPParameters=Prescaler,Period,TIM_MasterOutputTrigger
SAI1.BasicDataSize-SAI_A_AsyncSlave=SAI_PROTOCOL_DATASIZE_24BIT
PF6.Signal=GPIO_Output
PB3\ (JTDO/TRACESWO).Signal=S_TIM2_CH2
ProjectManager.TargetToolchain=Other Toolchains (GPDSC)
PB10.GPIO_Label=OLED_SCK
RCC.VCO1OutputFreq_Value=960000000
PC3_C.Locked=true
Dma.SAI1_A.2.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
PF6.Locked=true
SH.FMC_D13_DA13.0=FMC_D13,sd-16b-d1
SH.FMC_D1_DA1.ConfNb=1
SAI1.BasicDataSize-SAI_B_SyncSlave=SAI_PROTOCOL_DATASIZE_24BIT
PB2.GPIOParameters=GPIO_Label
RCC.AXIClockFreq_Value=240000000
VP_USB_DEVICE_VS_USB_DEVICE_AUDIO_HS.Mode=AUDIO_HS
SPI2.IPParameters=Mode,CalculateBaudRate,BaudRatePrescaler,DataSize,VirtualType,Direction
PF2.Signal=FMC_A2
PE2.GPIOParameters=GPIO_Label
PG10.GPIOParameters=GPIO_Label
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
PF9.GPIO_Label=Flash_MOSI
RCC.PLLSAIoutputFreq_Value=50000000
PE11.Signal=FMC_D8_DA8
RCC.LSE_VALUE=32768
PA7.GPIO_PuPd=GPIO_PULLUP
RCC.CKPERFreq_Value=16000000
SAI1.AudioMode-SAI_B_SyncSlave=SAI_MODESLAVE_RX
RCC.VCOI2SOutputFreq_Value=192000000
PG9.GPIO_Label=CS_CS
SH.S_TIM3_CH2.0=TIM3_CH2,Encoder_Interface
PG14.Signal=GPXTI14
RCC.PLLSAIPCLKFreq_Value=50000000
board=Player
SAI1.IPParameters=Instance-SAI_A_AsyncSlave,VirtualMode-SAI_A_AsyncSlave,Instance-SAI_B_SyncSlave,VirtualMode-SAI_B_SyncSlave,Synchro-SAI_B_SyncSlave,InitProtocol-SAI_B_SyncSlave,VirtualProtocol-SAI_B_BASIC,AudioMode-SAI_A_AsyncSlave,TriState-SAI_A_AsyncSlave,InitProtocol-SAI_A_AsyncSlave,VirtualProtocol-SAI_A_BASIC,BasicDataSize-SAI_B_SyncSlave,BasicDataSize-SAI_A_AsyncSlave,AudioMode-SAI_B_SyncSlave,Synchro-SAI_A_AsyncSlave
RCC.VCOOutputFreq_Value=336000000
PB15.Mode=Device_Only_FS
RCC.VCOInput1Freq_Value=5000000
NVIC.SavedSystickIrqHandlerGenerated=true
RCC.APB2Freq_Value=120000000
RCC.UART4Freq_Value=42000000
MxCube.Version=6.0.1
SH.FMC_D13_DA13.ConfNb=1
RCC.FDCANFreq_Value=48000000
Dma.SPI2_TX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
USB_HOST.USBH_HandleTypeDef-AUDIO_FS=hUsbHostFS
PE5.Mode=SAI_A_AsyncSlave
RCC.ADCFreq_Value=50390625
PC1.GPIO_Label=OLED_MOSI
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
Dma.ADC3.1.SyncEnable=DISABLE
TIM6.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
SH.FMC_D12_DA12.0=FMC_D12,sd-16b-d1
Dma.ADC3.1.MemInc=DMA_MINC_ENABLE
PF15.Signal=FMC_A9
SPI4.CalculateBaudRate=3.75 MBits/s
PF1.Signal=FMC_A1
PE6.Signal=SPI4_MOSI
SH.FMC_D11_DA11.ConfNb=1
RCC.UART5Freq_Value=42000000
PA15\ (JTDI).GPIO_Label=ENC1_CH1
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVN1,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HRTIMFreq_Value,HSE_VALUE,HSI_VALUE,I2C123Freq_Value,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LCDTFToutputFreq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LSE_VALUE,LSI_VALUE,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLFRACN,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLI2SRoutputFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,PLLQoutputFreq_Value,PLLSAIN,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PLLSAIRCLKFreq_Value,PLLSAIoutputFreq_Value,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI23Freq_Value,SAI2Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,UART4Freq_Value,UART5Freq_Value,UART7Freq_Value,UART8Freq_Value,USART16Freq_Value,USART1Freq_Value,USART234578Freq_Value,USART2Freq_Value,USART3Freq_Value,USART6Freq_Value,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOI2SOutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value
Dma.ADC3.1.Mode=DMA_CIRCULAR
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H743ZGTx
PE0.Signal=FMC_NBL0
PE12.Signal=FMC_D9_DA9
NVIC.SavedPendsvIrqHandlerGenerated=true
PA2.Signal=USART2_TX
Mcu.IP8=SPI4
Mcu.IP9=SPI5
PD14.Signal=FMC_D0_DA0
Mcu.IP6=SAI1
Mcu.IP7=SPI2
ProjectManager.CoupleFile=false
Dma.SPI2_TX.0.Priority=DMA_PRIORITY_LOW
RCC.SYSCLKFreq_VALUE=480000000
RCC.I2C123Freq_Value=120000000
PA7.GPIO_Label=ENC2_CH2
PA12.Mode=Host_Only
SH.GPXTI4.0=GPIO_EXTI4
KeepUserPlacement=true
PB2.Mode=SAI_A_AsyncSlave
SAI1.Instance-SAI_B_SyncSlave=SAI$Index_Block_B
PB2.GPIO_Label=CS_SDIN
PF6.GPIOParameters=GPIO_Label
SH.GPXTI4.ConfNb=1
RCC.HSI_VALUE=16000000
Dma.SAI1_A.2.SyncSignalID=NONE
RCC.PLLQ=7
RCC.SAI4AFreq_Value=48000000
RCC.PLLM=25
PC3_C.Signal=GPIO_Output
RCC.PLLN=336
RCC.DIVQ1Freq_Value=48000000
PC2_C.GPIOParameters=GPIO_Label
PA2.Mode=Asynchronous
PE3.GPIO_Label=CS_SDOUT
Dma.SAI1_B.3.Mode=DMA_CIRCULAR
RCC.D3PPRE=RCC_APB4_DIV2
PC9.Signal=GPIO_Output
SH.FMC_D8_DA8.ConfNb=1
Dma.SPI2_TX.0.Direction=DMA_MEMORY_TO_PERIPH
RCC.VCOInput2Freq_Value=781250
RCC.APB1Freq_Value=120000000
SAI1.InitProtocol-SAI_B_SyncSlave=Enable
ProjectManager.DeviceId=STM32H743ZGTx
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=2
SPI5.Direction=SPI_DIRECTION_2LINES
Dma.SAI1_A.2.Polarity=HAL_DMAMUX_REQ_GEN_RISING
PA7.Signal=S_TIM3_CH2
PB4\ (NJTRST).Signal=GPXTI4
